Tekla Open API Reference for Tekla Structures 2025
Angle.TryParse Method
Overload List
Name | Description
TryParse(String, Angle)
 Parses the given text as an angle in the current unit type
TryParse(String, IFormatProvider, Angle)
 Parses the given text as an angle in the current unit type
TryParse(String, IFormatProvider, Angle.UnitType, Angle)
 Parses the given text as an angle in the current unit type
Top
See Also
Reference
Angle Class
Tekla.Structures.Datatype Namespace